content/en/events.org
#+TITLE: Richard Davis, Composer
#+SUBTITLE: Events
#+AUTHOR: Richard Davis
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

#+INCLUDE: ./header.org

* Upcoming
:PROPERTIES:
:CUSTOM_ID: events-upcoming
:END:

** DCS Concert <2023-04-14 Fri>

Dani Claxton will be performing my work "Till this Moment" for solo vocalist and electronics at the upcoming Digital Composition Studio's Class Concert.

* Past

** MASC Concert <2023-03-19 Sun 20:00>

My 2019 solo clarinet work "One need not be a Chamber" will be performed by clarinetist Alexander Ortins and narrated by Dani Claxton at the McGill Association of Student Composers' [[https://www.mcgill.ca/music/channels/event/mcgill-association-student-composers-concert-342228][Winter Concert]].

"One need not be a Chamber" is a work for solo clarinet and optional narrator, based on the Emily Dickinson poem "One need not be a Chamber---to be Haunted---".
The music maintains an intimate, line-by-line relationship with the poem, translating various motifs and features of the text into leitmotifs---in the loosest sense---that accompany the emotional arc of Dickinson's poem.

** MASC Concert <2022-11-19 Sat 20:00>

I'll be performing Daniel Claxton's "Vocalise and Fantasia for Viola" at the McGill Association of Student Composers' [[https://www.mcgill.ca/music/channels/event/mcgill-association-student-composers-concert-341592][Fall Concert]].
