en/events.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-04 Tue 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Richard Davis, Composer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Richard Davis" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Richard Davis, Composer
<br />
<span class="subtitle">Events</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#events-upcoming">Upcoming</a>
<ul>
<li><a href="#org8364eb1">DCS Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-04-14 Fri&gt;</span></span></a></li>
</ul>
</li>
<li><a href="#org5a1dd72">Past</a>
<ul>
<li><a href="#org50c19bf">MASC Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-03-19 Sun 20:00&gt;</span></span></a></li>
<li><a href="#orgf9b724c">MASC Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-11-19 Sat 20:00&gt;</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./index.html">Home</a></td>
<td class="org-left"><a href="./events.html">Events</a></td>
<td class="org-left"><a href="./press.html">Press</a></td>
<td class="org-left"><a href="./listening.html">Listening</a></td>
<td class="org-left"><a href="../fr/index.html">FR</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-orgd6de161" class="outline-2">
<h2 id="events-upcoming">Upcoming</h2>
<div class="outline-text-2" id="text-events-upcoming">
</div>

<div id="outline-container-org8364eb1" class="outline-3">
<h3 id="org8364eb1">DCS Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-04-14 Fri&gt;</span></span></h3>
<div class="outline-text-3" id="text-org8364eb1">
<p>
Dani Claxton will be performing my work "Till this Moment" for solo vocalist and electronics at the upcoming Digital Composition Studio's Class Concert.
</p>
</div>
</div>
</div>

<div id="outline-container-org5a1dd72" class="outline-2">
<h2 id="org5a1dd72">Past</h2>
<div class="outline-text-2" id="text-org5a1dd72">
</div>
<div id="outline-container-org50c19bf" class="outline-3">
<h3 id="org50c19bf">MASC Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-03-19 Sun 20:00&gt;</span></span></h3>
<div class="outline-text-3" id="text-org50c19bf">
<p>
My 2019 solo clarinet work "One need not be a Chamber" will be performed by clarinetist Alexander Ortins and narrated by Dani Claxton at the McGill Association of Student Composers' <a href="https://www.mcgill.ca/music/channels/event/mcgill-association-student-composers-concert-342228">Winter Concert</a>.
</p>

<p>
"One need not be a Chamber" is a work for solo clarinet and optional narrator, based on the Emily Dickinson poem "One need not be a Chamber&#x2014;to be Haunted&#x2014;".
The music maintains an intimate, line-by-line relationship with the poem, translating various motifs and features of the text into leitmotifs&#x2014;in the loosest sense&#x2014;that accompany the emotional arc of Dickinson's poem.
</p>
</div>
</div>

<div id="outline-container-orgf9b724c" class="outline-3">
<h3 id="orgf9b724c">MASC Concert <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-11-19 Sat 20:00&gt;</span></span></h3>
<div class="outline-text-3" id="text-orgf9b724c">
<p>
I'll be performing Daniel Claxton's "Vocalise and Fantasia for Viola" at the McGill Association of Student Composers' <a href="https://www.mcgill.ca/music/channels/event/mcgill-association-student-composers-concert-341592">Fall Concert</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Richard Davis</p>
<p class="date">Created: 2023-04-04 Tue 14:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
